tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    floor
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
    ceiling
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            empty;
    }
    "baffle1Wall.*"
    {
        type            calculated;
    }
}


// ************************************************************************* //
