tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/constant/baffleRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
floor
{
    type            patch;
    nFaces          10;
    startFace       256;
}

fixedWalls
{
    type            empty;
    nFaces          280;
    startFace       266;
}

region0_to_baffleRegion_baffleFaces2_top
{
    type            directMappedWall;
    nFaces          14;
    startFace       546;
    sampleMode      nearestPatchFace;
    sampleRegion    region0;
    samplePatch     region0_to_baffleRegion_baffleFaces2_top;
    offsetMode      nonuniform;
    offsets         14 ( ( -0.02 -8.67362e-19 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 6.93889e-18 0 ) ( -0.02 6.93889e-18 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 0 0 ) ( -0.02 2.77556e-17 0 ) );
}

region0_to_baffleRegion_baffleFaces2_bottom
{
    type            directMappedWall;
    nFaces          14;
    startFace       560;
    sampleMode      nearestPatchFace;
    sampleRegion    region0;
    samplePatch     region0_to_baffleRegion_baffleFaces2_bottom;
    offsetMode      nonuniform;
    offsets         14 ( ( -1.11022e-16 -8.67362e-19 0 ) ( -1.11022e-16 3.46945e-18 0 ) ( 1.11022e-16 0 0 ) ( 1.11022e-16 6.93889e-18 -1.11022e-16 ) ( 1.11022e-16 1.38778e-17 0 ) ( 1.11022e-16 -1.38778e-17 0 ) ( 1.11022e-16 0 0 ) ( 0 0 0 ) ( 1.11022e-16 0 0 ) ( 1.11022e-16 0 0 ) ( 0 0 0 ) ( 0 2.77556e-17 0 ) ( 0 0 0 ) ( 0 2.77556e-17 0 ) );
}

baffleFaces2_side
{
    type            patch;
    nFaces          10;
    startFace       574;
}

)


// ************************************************************************* //
